##================================================================================##
## Copy these constraints to your top-level pdc and replace path with actual path   
##================================================================================##
set CLK_PERIOD 40.0
create_clock -name {clk_i} -period $CLK_PERIOD [get_ports clk_i]

##================================================================================##
## Recommended to use these constraints if clock frequency is greater than 25MHz
##================================================================================##
create_generated_clock -name {int_sysclk} -source [get_ports clk_i] -divide_by 2 [get_nets -hierarchical *i3c_controller_inst/u_i3c_mst/scl_src_*]

##================================================================================##
## False Path constraints 
##================================================================================##
set_false_path -from [get_ports rst_n_i]

##================================================================================##
## Maximum skew constraints 
##================================================================================##
set_max_skew [get_pins -hierarchical {*i3c_controller_inst/gen_prim*.u_i3c_scl*/I *i3c_controller_inst/gen_prim*.u_i3c_scl*/T *i3c_controller_inst/gen_prim*.u_i3c_sda*/I *i3c_controller_inst/gen_prim*.u_i3c_sda*/T}] 2

##================================END OF COSTRAINTS===============================##
