##================================================================================##
## Copy these constraints to your top-level pdc and replace path with actual path 
##================================================================================##
set CLK_PERIOD 40.0
set EDGE_VALUE 20.0

## Change SDA and SCL frequency according to your design 
set EDGEV_SCLV 40.0
set SCL_PERIOD 80.0
set EDGEV_SDAV 80.0
set SDA_PERIOD 160.0

##================================================================================##
## Create clock constraints 
##================================================================================##
create_clock -name {clk_i} -period $CLK_PERIOD -waveform "0 $EDGE_VALUE" [get_ports clk_i]
create_clock -name scl_i -period $SCL_PERIOD -waveform "0 $EDGEV_SCLV" [get_ports scl_io]
create_clock -name sda_i -period $SDA_PERIOD -waveform "0 $EDGEV_SDAV" [get_ports sda_io]

##================================================================================##
## False path constraints                                                           
##================================================================================##
set_false_path -from [get_nets -hierarchical *i3c_target_inst/u_i3c_tgt/*rst_n*]
set_false_path -from [get_nets -hierarchical *i3c_target_inst/u_i3c_tgt/u_i3c_tgt_main/u_i3c_tgt_pattern_detector/*reset*]

set_false_path -to [get_nets -hierarchical *i3c_target_inst/u_i3c_tgt/u_i3c_tgt_main/sda_reg_sclp*]
set_false_path -to [get_nets -hierarchical *i3c_target_inst/u_i3c_tgt/u_i3c_tgt_main/sda_reg_scln*]
set_false_path -to [get_nets -hierarchical *i3c_target_inst/u_i3c_tgt/u_i3c_tgt_main/scl_reg_sdap*]
set_false_path -to [get_nets -hierarchical *i3c_target_inst/u_i3c_tgt/u_i3c_tgt_main/scl_reg_sdan*]
set_false_path -to [get_nets -hierarchical *i3c_target_inst/u_i3c_tgt/u_i3c_tgt_main/scl_reg_clkp*]
set_false_path -to [get_nets -hierarchical *i3c_target_inst/u_i3c_tgt/u_i3c_tgt_main/sda_reg_clkp*]

set_false_path -to [get_nets -hierarchical *i3c_target_inst/u_i3c_tgt/u_i3c_tgt_main/stop_det*]
set_false_path -to [get_nets -hierarchical *i3c_target_inst/u_i3c_tgt/u_i3c_tgt_main/sda_oe_reset*]
set_false_path -through [get_nets -hierarchical *i3c_target_inst/u_i3c_tgt/u_i3c_tgt_main/u_i3c_tgt_pattern_detector/*sda*]
set_false_path -through [get_nets -hierarchical *i3c_target_inst/u_i3c_tgt/u_i3c_tgt_main/u_i3c_tgt_pattern_detector/*scl*]
set_multicycle_path 2 -hold -end -from [get_pins -hierarchical *i3c_target_inst/u_i3c_tgt/u_i3c_tgt_main*/Q]
set_max_skew [get_pins -hierarchical {*i3c_target_inst/gen_prim*.u_i3c_scl.SEIO33_inst/I *i3c_target_inst/gen_prim*.u_i3c_scl.SEIO33_inst/T *i3c_target_inst/gen_prim*.u_i3c_sda.SEIO33_inst/I *i3c_target_inst/gen_prim*.u_i3c_sda.SEIO33_inst/T}] 2
