ldc_set_location -site {R3} [get_ports {led_o[0]}]
ldc_set_location -site {R2} [get_ports {led_o[1]}]
ldc_set_location -site {R1} [get_ports {led_o[2]}]
ldc_set_location -site {P7} [get_ports {led_o[3]}]
ldc_set_location -site {H12} [get_ports {led_o[4]}]
ldc_set_location -site {H11} [get_ports {led_o[5]}]
ldc_set_location -site {G13} [get_ports {led_o[6]}]
ldc_set_location -site {G12} [get_ports {led_o[7]}]
ldc_set_location -site {T1} [get_ports {led_o[8]}]
ldc_set_location -site {F20} [get_ports rstn_I]
ldc_set_location -site {B11} [get_ports rxd_i]
ldc_set_location -site {B12} [get_ports txd_o]
ldc_set_location -site {F14} [get_ports risc_inst_timer_timer_irq_o_port]
ldc_set_location -site {G11} [get_ports s0_rst_o]
ldc_set_location -site {B6} [get_ports m0_scl_io]
ldc_set_location -site {C3} [get_ports m0_sda_io]
ldc_set_location -site {C1} [get_ports s0_scl_io]
ldc_set_location -site {D6} [get_ports s0_sda_io]
ldc_set_port -iobuf {SLEWRATE=FAST PULLMODE=I3C DRIVE=8 IO_TYPE=LVCMOS18} [get_ports m0_scl_io]
ldc_set_port -iobuf {SLEWRATE=FAST PULLMODE=I3C DRIVE=8 IO_TYPE=LVCMOS18} [get_ports m0_sda_io]
ldc_set_port -iobuf {SLEWRATE=FAST PULLMODE=I3C DRIVE=8 IO_TYPE=LVCMOS18} [get_ports s0_scl_io]
ldc_set_port -iobuf {SLEWRATE=FAST PULLMODE=I3C DRIVE=8 IO_TYPE=LVCMOS18} [get_ports s0_sda_io]
create_clock -name {osc0_inst_hf_clk_out_o} -period 20 -waveform {0.000 10.000} [get_pins osc0_inst/lscc_osc_inst/gen_osca.u_OSC_A.OSCA_inst/HFCLKOUT]
create_generated_clock -name {pll0_inst_clkop_o_net} -source [get_pins pll0_inst/lscc_pll_inst/gen_no_refclk_mon.u_PLL.PLL_inst/REFCK] -multiply_by 2 [get_pins pll0_inst/lscc_pll_inst/gen_no_refclk_mon.u_PLL.PLL_inst/CLKOP]
#DISABLED# create_generated_clock -name {pll0_inst_clkos_o_net} -source [get_pins pll0_inst/lscc_pll_inst/gen_no_refclk_mon.u_PLL.PLL_inst/REFCK] -divide_by 4 [get_pins pll0_inst/lscc_pll_inst/gen_no_refclk_mon.u_PLL.PLL_inst/CLKOS]
ldc_set_vcc -bank 0 1.8
ldc_set_attribute {USE_PRIMARY=FALSE} [get_nets -hierarchical *i3c_s_inst*/*sda_i*]
ldc_set_attribute {USE_PRIMARY=FALSE} [get_nets -hierarchical *i3c_s_inst*/*/*sda_i*]
ldc_set_attribute {USE_PRIMARY=FALSE} [get_nets *s0_sda_io*]
ldc_set_attribute {USE_PRIMARY=FALSE} [get_nets reveal_ist_*]
set_clock_uncertainty -setup 0.1 [get_clocks pll0_inst_clkop_o_net]
set_clock_uncertainty -hold 0.05 [get_clocks pll0_inst_clkop_o_net]
set_clock_uncertainty -setup 0.1 [get_clocks pll0_inst_clkos_o_net]
set_clock_uncertainty -hold 0.05 [get_clocks pll0_inst_clkos_o_net]
set_false_path -through [get_nets i3c_s_inst/lscc_i3c_target_inst/scl_i]
set_false_path -from [get_nets {i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/ip_core_rst_n i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/main_rst_n i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/ip_csr_rst_n i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/txfifo_rst_n i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/rxfifo_rst_n i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/ip_core_rst_n_4 i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/ip_csr_rst_n_4 i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/rxfifo_rst_n_4 i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/txfifo_rst_n_4 i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/rxfifo_rst_n_i i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/txfifo_rst_n_i i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/ip_csr_rst_n_i i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/main_rst_n_i i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/ip_core_rst_n_i i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/rst_n_i_i}]
set_false_path -from [get_nets {i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/ip_core_rst_n i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/main_rst_n i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/ip_csr_rst_n i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/txfifo_rst_n i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/rxfifo_rst_n i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/ip_core_rst_n_4 i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/ip_csr_rst_n_4 i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/rxfifo_rst_n_4 i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/txfifo_rst_n_4 i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/rxfifo_rst_n_i i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/txfifo_rst_n_i i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/ip_csr_rst_n_i i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/main_rst_n_i i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/ip_core_rst_n_i i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/rst_n_i_i}]
set_false_path -through [get_nets i3c_s_inst/lscc_i3c_target_inst/scl_i]
set_false_path -from [get_nets {i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/u_i3c_tgt_main/tgt_reset i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/u_i3c_tgt_main/u_i3c_tgt_pattern_detector/det_reset_sr i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/u_i3c_tgt_main/u_i3c_tgt_pattern_detector/poss_reset_sr6 i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/u_i3c_tgt_main/u_i3c_tgt_pattern_detector/poss_reset_sr i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/u_i3c_tgt_main/u_i3c_tgt_pattern_detector/is_reset_sr}]
set_max_delay -from [get_pins {i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/gen_fifo_target.u_tx_fifo/gen_pmi.gen_async.u_fifo/u_fifo0/fifo_dc0/_FABRIC.u_fifo/rd_encode_async.rd_grey_sync_r[0].ff_inst/Q i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/gen_fifo_target.u_tx_fifo/gen_pmi.gen_async.u_fifo/u_fifo0/fifo_dc0/_FABRIC.u_fifo/rd_encode_async.rd_grey_sync_r[1].ff_inst/Q i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/gen_fifo_target.u_tx_fifo/gen_pmi.gen_async.u_fifo/u_fifo0/fifo_dc0/_FABRIC.u_fifo/rd_encode_async.rd_grey_sync_r[2].ff_inst/Q i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/gen_fifo_target.u_tx_fifo/gen_pmi.gen_async.u_fifo/u_fifo0/fifo_dc0/_FABRIC.u_fifo/rd_encode_async.rd_grey_sync_r[3].ff_inst/Q i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/gen_fifo_target.u_tx_fifo/gen_pmi.gen_async.u_fifo/u_fifo0/fifo_dc0/_FABRIC.u_fifo/rd_encode_async.rd_grey_sync_r[4].ff_inst/Q i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/gen_fifo_target.u_tx_fifo/gen_pmi.gen_async.u_fifo/u_fifo0/fifo_dc0/_FABRIC.u_fifo/rd_encode_async.rd_grey_sync_r[5].ff_inst/Q i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/gen_fifo_target.u_tx_fifo/gen_pmi.gen_async.u_fifo/u_fifo0/fifo_dc0/_FABRIC.u_fifo/rd_encode_async.rd_grey_sync_r[6].ff_inst/Q i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/gen_fifo_target.u_tx_fifo/gen_pmi.gen_async.u_fifo/u_fifo0/fifo_dc0/_FABRIC.u_fifo/rd_encode_async.rd_grey_sync_r[7].ff_inst/Q i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/gen_fifo_target.u_tx_fifo/gen_pmi.gen_async.u_fifo/u_fifo0/fifo_dc0/_FABRIC.u_fifo/rd_encode_async.rd_grey_sync_r[8].ff_inst/Q i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/gen_fifo_target.u_tx_fifo/gen_pmi.gen_async.u_fifo/u_fifo0/fifo_dc0/_FABRIC.u_fifo/rd_encode_async.rd_grey_sync_r[9].ff_inst/Q }] -to [get_pins {i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/gen_fifo_target.u_tx_fifo/gen_pmi.gen_async.u_fifo/u_fifo0/fifo_dc0/_FABRIC.u_fifo/genblk2.rp_sync1_r[0].ff_inst/DF i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/gen_fifo_target.u_tx_fifo/gen_pmi.gen_async.u_fifo/u_fifo0/fifo_dc0/_FABRIC.u_fifo/genblk2.rp_sync1_r[1].ff_inst/DF i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/gen_fifo_target.u_tx_fifo/gen_pmi.gen_async.u_fifo/u_fifo0/fifo_dc0/_FABRIC.u_fifo/genblk2.rp_sync1_r[2].ff_inst/DF i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/gen_fifo_target.u_tx_fifo/gen_pmi.gen_async.u_fifo/u_fifo0/fifo_dc0/_FABRIC.u_fifo/genblk2.rp_sync1_r[3].ff_inst/DF i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/gen_fifo_target.u_tx_fifo/gen_pmi.gen_async.u_fifo/u_fifo0/fifo_dc0/_FABRIC.u_fifo/genblk2.rp_sync1_r[4].ff_inst/DF i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/gen_fifo_target.u_tx_fifo/gen_pmi.gen_async.u_fifo/u_fifo0/fifo_dc0/_FABRIC.u_fifo/genblk2.rp_sync1_r[5].ff_inst/DF i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/gen_fifo_target.u_tx_fifo/gen_pmi.gen_async.u_fifo/u_fifo0/fifo_dc0/_FABRIC.u_fifo/genblk2.rp_sync1_r[6].ff_inst/DF i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/gen_fifo_target.u_tx_fifo/gen_pmi.gen_async.u_fifo/u_fifo0/fifo_dc0/_FABRIC.u_fifo/genblk2.rp_sync1_r[7].ff_inst/DF i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/gen_fifo_target.u_tx_fifo/gen_pmi.gen_async.u_fifo/u_fifo0/fifo_dc0/_FABRIC.u_fifo/genblk2.rp_sync1_r[8].ff_inst/DF i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/gen_fifo_target.u_tx_fifo/gen_pmi.gen_async.u_fifo/u_fifo0/fifo_dc0/_FABRIC.u_fifo/genblk2.rp_sync1_r[9].ff_inst/DF }] -datapath_only 72
set_max_skew [get_pins {i3c_m_inst/lscc_i3c_controller_inst/gen_prim.u_i3c_scl.SEIO33_inst/I i3c_m_inst/lscc_i3c_controller_inst/gen_prim.u_i3c_scl.SEIO33_inst/T i3c_m_inst/lscc_i3c_controller_inst/gen_prim.u_i3c_sda.SEIO33_inst/I i3c_m_inst/lscc_i3c_controller_inst/gen_prim.u_i3c_sda.SEIO33_inst/T}] 2
set_false_path -from [get_nets {i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/ip_core_rst_n i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/main_rst_n i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/ip_csr_rst_n i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/txfifo_rst_n i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/rxfifo_rst_n i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/ip_core_rst_n_4 i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/ip_csr_rst_n_4 i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/rxfifo_rst_n_4 i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/txfifo_rst_n_4 i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/rxfifo_rst_n_i i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/txfifo_rst_n_i i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/ip_csr_rst_n_i i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/main_rst_n_i i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/ip_core_rst_n_i i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/rst_n_i_i}]
set_false_path -from [get_nets {i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/ip_core_rst_n i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/main_rst_n i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/ip_csr_rst_n i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/txfifo_rst_n i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/rxfifo_rst_n i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/ip_core_rst_n_4 i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/ip_csr_rst_n_4 i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/rxfifo_rst_n_4 i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/txfifo_rst_n_4 i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/rxfifo_rst_n_i i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/txfifo_rst_n_i i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/ip_csr_rst_n_i i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/main_rst_n_i i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/ip_core_rst_n_i i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/rst_n_i_i}]
set_max_skew [get_pins {i3c_m_inst/lscc_i3c_controller_inst/gen_prim.u_i3c_scl.SEIO33_inst/I i3c_m_inst/lscc_i3c_controller_inst/gen_prim.u_i3c_scl.SEIO33_inst/T i3c_m_inst/lscc_i3c_controller_inst/gen_prim.u_i3c_sda.SEIO33_inst/I i3c_m_inst/lscc_i3c_controller_inst/gen_prim.u_i3c_sda.SEIO33_inst/T}] 2
set_false_path -from [get_nets {i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/ip_core_rst_n i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/main_rst_n i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/ip_csr_rst_n i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/txfifo_rst_n i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/rxfifo_rst_n i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/ip_core_rst_n_4 i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/ip_csr_rst_n_4 i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/rxfifo_rst_n_4 i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/txfifo_rst_n_4 i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/rxfifo_rst_n_i i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/txfifo_rst_n_i i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/ip_csr_rst_n_i i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/main_rst_n_i i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/ip_core_rst_n_i i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/rst_n_i_i}]
set_false_path -from [get_nets {i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/u_i3c_tgt_main/tgt_reset i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/u_i3c_tgt_main/u_i3c_tgt_pattern_detector/det_reset_sr i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/u_i3c_tgt_main/u_i3c_tgt_pattern_detector/poss_reset_sr6 i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/u_i3c_tgt_main/u_i3c_tgt_pattern_detector/poss_reset_sr i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/u_i3c_tgt_main/u_i3c_tgt_pattern_detector/is_reset_sr}]
set_false_path -to [get_nets i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/u_i3c_tgt_main/sda_reg_sclp]
set_false_path -to [get_nets {i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/u_i3c_tgt_main/sda_reg_scln_3 i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/u_i3c_tgt_main/sda_reg_scln}]
set_false_path -to [get_nets i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/u_i3c_tgt_main/scl_reg_sdap]
set_false_path -to [get_nets i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/u_i3c_tgt_main/scl_reg_sdan]
set_false_path -to [get_nets {i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/u_i3c_tgt_main/scl_reg_clkp[2] i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/u_i3c_tgt_main/scl_reg_clkp[1] i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/u_i3c_tgt_main/scl_reg_clkp[0]}]
set_false_path -to [get_nets {i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/u_i3c_tgt_main/stop_det6 i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/u_i3c_tgt_main/stop_det}]
set_false_path -to [get_nets i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/u_i3c_tgt_main/sda_oe_reset]
set_false_path -through [get_nets {i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/u_i3c_tgt_main/rst_stop_sdan_n_1_i i3c_s_inst/lscc_i3c_target_inst/sda_i}]
set_false_path -through [get_nets i3c_s_inst/lscc_i3c_target_inst/scl_i]
set_max_delay -from [get_pins {i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/gen_fifo_target.u_tx_fifo/gen_pmi.gen_async.u_fifo/u_fifo0/fifo_dc0/_FABRIC.u_fifo/wr_encode_async.wr_grey_sync_r[0].ff_inst/Q i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/gen_fifo_target.u_tx_fifo/gen_pmi.gen_async.u_fifo/u_fifo0/fifo_dc0/_FABRIC.u_fifo/wr_encode_async.wr_grey_sync_r[1].ff_inst/Q i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/gen_fifo_target.u_tx_fifo/gen_pmi.gen_async.u_fifo/u_fifo0/fifo_dc0/_FABRIC.u_fifo/wr_encode_async.wr_grey_sync_r[2].ff_inst/Q i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/gen_fifo_target.u_tx_fifo/gen_pmi.gen_async.u_fifo/u_fifo0/fifo_dc0/_FABRIC.u_fifo/wr_encode_async.wr_grey_sync_r[3].ff_inst/Q i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/gen_fifo_target.u_tx_fifo/gen_pmi.gen_async.u_fifo/u_fifo0/fifo_dc0/_FABRIC.u_fifo/wr_encode_async.wr_grey_sync_r[4].ff_inst/Q i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/gen_fifo_target.u_tx_fifo/gen_pmi.gen_async.u_fifo/u_fifo0/fifo_dc0/_FABRIC.u_fifo/wr_encode_async.wr_grey_sync_r[5].ff_inst/Q i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/gen_fifo_target.u_tx_fifo/gen_pmi.gen_async.u_fifo/u_fifo0/fifo_dc0/_FABRIC.u_fifo/wr_encode_async.wr_grey_sync_r[6].ff_inst/Q i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/gen_fifo_target.u_tx_fifo/gen_pmi.gen_async.u_fifo/u_fifo0/fifo_dc0/_FABRIC.u_fifo/wr_encode_async.wr_grey_sync_r[7].ff_inst/Q i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/gen_fifo_target.u_tx_fifo/gen_pmi.gen_async.u_fifo/u_fifo0/fifo_dc0/_FABRIC.u_fifo/wr_encode_async.wr_grey_sync_r[8].ff_inst/Q i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/gen_fifo_target.u_tx_fifo/gen_pmi.gen_async.u_fifo/u_fifo0/fifo_dc0/_FABRIC.u_fifo/wr_encode_async.wr_grey_sync_r[9].ff_inst/Q }] -to [get_pins {i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/gen_fifo_target.u_tx_fifo/gen_pmi.gen_async.u_fifo/u_fifo0/fifo_dc0/_FABRIC.u_fifo/.wp_sync1_r[0].ff_inst/DF i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/gen_fifo_target.u_tx_fifo/gen_pmi.gen_async.u_fifo/u_fifo0/fifo_dc0/_FABRIC.u_fifo/.wp_sync1_r[1].ff_inst/DF i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/gen_fifo_target.u_tx_fifo/gen_pmi.gen_async.u_fifo/u_fifo0/fifo_dc0/_FABRIC.u_fifo/.wp_sync1_r[2].ff_inst/DF i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/gen_fifo_target.u_tx_fifo/gen_pmi.gen_async.u_fifo/u_fifo0/fifo_dc0/_FABRIC.u_fifo/.wp_sync1_r[3].ff_inst/DF i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/gen_fifo_target.u_tx_fifo/gen_pmi.gen_async.u_fifo/u_fifo0/fifo_dc0/_FABRIC.u_fifo/.wp_sync1_r[4].ff_inst/DF i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/gen_fifo_target.u_tx_fifo/gen_pmi.gen_async.u_fifo/u_fifo0/fifo_dc0/_FABRIC.u_fifo/.wp_sync1_r[5].ff_inst/DF i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/gen_fifo_target.u_tx_fifo/gen_pmi.gen_async.u_fifo/u_fifo0/fifo_dc0/_FABRIC.u_fifo/.wp_sync1_r[6].ff_inst/DF i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/gen_fifo_target.u_tx_fifo/gen_pmi.gen_async.u_fifo/u_fifo0/fifo_dc0/_FABRIC.u_fifo/.wp_sync1_r[7].ff_inst/DF i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/gen_fifo_target.u_tx_fifo/gen_pmi.gen_async.u_fifo/u_fifo0/fifo_dc0/_FABRIC.u_fifo/.wp_sync1_r[8].ff_inst/DF i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/gen_fifo_target.u_tx_fifo/gen_pmi.gen_async.u_fifo/u_fifo0/fifo_dc0/_FABRIC.u_fifo/.wp_sync1_r[9].ff_inst/DF }] -datapath_only 2.5
set_max_delay -from [get_pins {i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/gen_fifo_target.u_tx_fifo/gen_pmi.gen_async.u_fifo/u_fifo0/fifo_dc0/_FABRIC.u_fifo/rd_encode_async.rd_grey_sync_r[0].ff_inst/Q i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/gen_fifo_target.u_tx_fifo/gen_pmi.gen_async.u_fifo/u_fifo0/fifo_dc0/_FABRIC.u_fifo/rd_encode_async.rd_grey_sync_r[1].ff_inst/Q i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/gen_fifo_target.u_tx_fifo/gen_pmi.gen_async.u_fifo/u_fifo0/fifo_dc0/_FABRIC.u_fifo/rd_encode_async.rd_grey_sync_r[2].ff_inst/Q i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/gen_fifo_target.u_tx_fifo/gen_pmi.gen_async.u_fifo/u_fifo0/fifo_dc0/_FABRIC.u_fifo/rd_encode_async.rd_grey_sync_r[3].ff_inst/Q i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/gen_fifo_target.u_tx_fifo/gen_pmi.gen_async.u_fifo/u_fifo0/fifo_dc0/_FABRIC.u_fifo/rd_encode_async.rd_grey_sync_r[4].ff_inst/Q i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/gen_fifo_target.u_tx_fifo/gen_pmi.gen_async.u_fifo/u_fifo0/fifo_dc0/_FABRIC.u_fifo/rd_encode_async.rd_grey_sync_r[5].ff_inst/Q i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/gen_fifo_target.u_tx_fifo/gen_pmi.gen_async.u_fifo/u_fifo0/fifo_dc0/_FABRIC.u_fifo/rd_encode_async.rd_grey_sync_r[6].ff_inst/Q i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/gen_fifo_target.u_tx_fifo/gen_pmi.gen_async.u_fifo/u_fifo0/fifo_dc0/_FABRIC.u_fifo/rd_encode_async.rd_grey_sync_r[7].ff_inst/Q i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/gen_fifo_target.u_tx_fifo/gen_pmi.gen_async.u_fifo/u_fifo0/fifo_dc0/_FABRIC.u_fifo/rd_encode_async.rd_grey_sync_r[8].ff_inst/Q i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/gen_fifo_target.u_tx_fifo/gen_pmi.gen_async.u_fifo/u_fifo0/fifo_dc0/_FABRIC.u_fifo/rd_encode_async.rd_grey_sync_r[9].ff_inst/Q }] -to [get_pins {i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/gen_fifo_target.u_tx_fifo/gen_pmi.gen_async.u_fifo/u_fifo0/fifo_dc0/_FABRIC.u_fifo/genblk2.rp_sync1_r[0].ff_inst/DF i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/gen_fifo_target.u_tx_fifo/gen_pmi.gen_async.u_fifo/u_fifo0/fifo_dc0/_FABRIC.u_fifo/genblk2.rp_sync1_r[1].ff_inst/DF i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/gen_fifo_target.u_tx_fifo/gen_pmi.gen_async.u_fifo/u_fifo0/fifo_dc0/_FABRIC.u_fifo/genblk2.rp_sync1_r[2].ff_inst/DF i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/gen_fifo_target.u_tx_fifo/gen_pmi.gen_async.u_fifo/u_fifo0/fifo_dc0/_FABRIC.u_fifo/genblk2.rp_sync1_r[3].ff_inst/DF i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/gen_fifo_target.u_tx_fifo/gen_pmi.gen_async.u_fifo/u_fifo0/fifo_dc0/_FABRIC.u_fifo/genblk2.rp_sync1_r[4].ff_inst/DF i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/gen_fifo_target.u_tx_fifo/gen_pmi.gen_async.u_fifo/u_fifo0/fifo_dc0/_FABRIC.u_fifo/genblk2.rp_sync1_r[5].ff_inst/DF i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/gen_fifo_target.u_tx_fifo/gen_pmi.gen_async.u_fifo/u_fifo0/fifo_dc0/_FABRIC.u_fifo/genblk2.rp_sync1_r[6].ff_inst/DF i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/gen_fifo_target.u_tx_fifo/gen_pmi.gen_async.u_fifo/u_fifo0/fifo_dc0/_FABRIC.u_fifo/genblk2.rp_sync1_r[7].ff_inst/DF i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/gen_fifo_target.u_tx_fifo/gen_pmi.gen_async.u_fifo/u_fifo0/fifo_dc0/_FABRIC.u_fifo/genblk2.rp_sync1_r[8].ff_inst/DF i3c_s_inst/lscc_i3c_target_inst/u_i3c_tgt/gen_fifo_target.u_tx_fifo/gen_pmi.gen_async.u_fifo/u_fifo0/fifo_dc0/_FABRIC.u_fifo/genblk2.rp_sync1_r[9].ff_inst/DF }] -datapath_only 72
